
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДатуОстатков();
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуОстатков()
	ТекущаяДата = ТекущаяДата(); 
	ДатаСтрокой = Формат(ТекущаяДата,"ДФ='dd MMMM yyyy'");
	Объект.Дата = ДатаСтрокой;
КонецПроцедуры


&НаСервере
Процедура СформироватьОстаткиНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОстатков) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните значение даты!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) и Объект.ПоВсемСкладам = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните значение Склад!"
		"Или включите поиск по всем складам";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Объект.ПоВсемСкладам = Ложь Тогда
		Объект.Номенклатура.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Остаток,
		|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура.Артикул";
		
		Запрос.УстановитьПараметр("ДатаОстатков", Объект.ДатаОстатков);
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		КонецЦикла;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данные получены по складу:"+" "+Объект.Склад+"!";
		Сообщение.Сообщить(); 
		
	ИначеЕсли 
		Объект.ПоВсемСкладам = Истина Тогда
		Объект.Номенклатура.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК Остаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, ) КАК ТоварыНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура.Артикул";  
		
		Запрос.УстановитьПараметр("ДатаОстатков", Объект.ДатаОстатков);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		КонецЦикла;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данные получены по всем складам!!!";
		Сообщение.Сообщить(); 
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура СформироватьОстатки(Команда)
	ОчиститьСообщения();
	СформироватьОстаткиНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПоВсемСкладамПриИзменении(Элемент)
	Если Объект.ПоВсемСкладам = Истина Тогда 
		Элементы.Склад.Видимость  = Ложь;
		Объект.Номенклатура.Очистить();
		Элементы.Номенклатура.Обновить();
	ИначеЕсли
		Объект.ПоВсемСкладам = Ложь Тогда
		Объект.Номенклатура.Очистить();
		Элементы.Склад.Видимость  = Истина;
		Элементы.Номенклатура.Обновить();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СохранитьВExcelНаСервере(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	ОчиститьСообщения();
	Если ВыбранныеФайлы = Неопределено  Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Каталог для загрузки не выбран!" 
		"Выбирете куда сохранять Файл";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Область(1,1).Текст = "Номенклатура";
	ТабДок.Область(1,1).ШиринаКолонки = 40; 
	ТабДок.Область(1,1).ЦветФона = WebЦвета.БледноБирюзовый;
	
	ТабДок.Область(1,2).Текст = "Склад";
	ТабДок.Область(1,2).ШиринаКолонки = 40;
	ТабДок.Область(1,2).ЦветФона = WebЦвета.Фиолетовый;
	
	
	ТабДок.Область(1,3).Текст = "Артикул";
	ТабДок.Область(1,3).ШиринаКолонки = 30;
	ТабДок.Область(1,3).ЦветФона = WebЦвета.БледноБирюзовый;
	
	
	ТабДок.Область(1,4).Текст = "Количество";
	ТабДок.Область(1,4).ШиринаКолонки = 20;
	ТабДок.Область(1,4).ЦветФона = WebЦвета.КоролевскиГолубой;
	
	НомерСтроки = 2;
	Для каждого СтрокаТч Из Объект.Номенклатура Цикл
		ТабДок.Область(НомерСтроки,1).Текст = СтрокаТч.Номенклатура;
		ТабДок.Область(НомерСтроки,2).Текст = СтрокаТч.Склад;
		ТабДок.Область(НомерСтроки,3).Текст = СтрокаТч.Артикул;
		ТабДок.Область(НомерСтроки,4).Текст = СтрокаТч.Остаток;
		НомерСтроки = НомерСтроки+1;
	КонецЦикла;  
	Попытка
		ОчиститьСообщения();
		ТабДок.НачатьЗапись("ПослеЗаписиФайла", ПутьКФайлу,ТипФайлаТабличногоДокумента.XLS);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Записано!";
		Сообщение.Сообщить();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось сохранить файл" + ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьВExel(Команда)
	Оповещение = Новый ОписаниеОповещения("СохранитьВExcelНаСервере",ЭтотОбъект);
	Проводник = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Проводник.Фильтр = "Документ Excel|*.xls;.xlsx;xlsm"; 
	Проводник.Заголовок = "Выберите каталог загрузки вашего документа";
	Проводник.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиФайла(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = Истина Тогда
		ПоказатьОповещениеПользователя("Файл Записан! ");
	КонецЕсли; 
КонецПроцедуры
